app/controllers/posts_controller.rb

def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "much functionality is added"], ["updated_at", "2023-07-25 16:09:51.674043"], ["id", 1]]

def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first blog app"], ["content", "built with rails + other gems"], ["text", nil], ["created_at", "2023-07-25 11:54:12.014386"], ["updated_at", "2023-07-25 11:54:12.014386"]]